       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZBUZZ.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CURRENT-NUMBER PIC 99.
       01 CURRENT-RESULT PIC X(8).
       
       PROCEDURE DIVISION.
           DISPLAY "FIZZ"

           GOBACK.
       1000-PROCESS-NUMBER SECTION. 
           IF FUNCTION MOD (CURRENT-NUMBER, 3) = 0
           THEN
             MOVE "FIZZ" TO CURRENT-RESULT
           ELSE
             MOVE CURRENT-NUMBER TO CURRENT-RESULT
             INSPECT CURRENT-RESULT REPLACING 
               LEADING "0" BY " "
           END-IF
           EXIT.
       END PROGRAM FIZZBUZZ.
