       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZBUZZ.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CURRENT-NUMBER PIC 99.
       01 CURRENT-RESULT PIC X(8).
       
       PROCEDURE DIVISION.
           DISPLAY "FIZZ"

           GOBACK.
       1000-PROCESS-NUMBER SECTION. 
           MOVE "FIZZ"
             TO CURRENT-RESULT
           EXIT.
       END PROGRAM FIZZBUZZ.
