       IDENTIFICATION DIVISION.
       PROGRAM-ID. HalloWwu.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "Hallo WWU!"
           GOBACK
          .

       END PROGRAM HalloWwu.
