       IDENTIFICATION DIVISION.
       PROGRAM-ID.  MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABELLE.
        02 MEMORY-TABELLE  OCCURS 30000000.
          05 LAST-ROUND PIC 9(08).
       01 LAST-ANNOUNCED-NUMBER PIC 9(08).
       01 NEXT-NUMBER PIC 9(08).
       01 ROUND-NUMBER PIC 9(08).
       01 NUMBER-TO-SAVE PIC 9(08).
       01 ROUNDS-TO-PLAY PIC 9(08).
       01 MAX-ANNOUNCED-NUMBER PIC 9(08).
       01 EINGABE.
        02 EINGABE-TABELLE OCCURS 10.
          05 STARTING-NUMBER PIC 99.
          05 FILLER PIC X.
       01 ZAEHLER PIC 99.
       PROCEDURE DIVISION.
           DISPLAY "Willkommen zum Elfen-Memory!"
           DISPLAY "Wieviele Runden sollen gespielt werden?"
           ACCEPT ROUNDS-TO-PLAY

           DISPLAY "Bitte Startfolge eingeben (zB. 01,02,03):"
           ACCEPT EINGABE

           PERFORM VARYING ZAEHLER FROM 1 BY 1 
             UNTIL STARTING-NUMBER (ZAEHLER) IS NOT NUMERIC
             MOVE ZAEHLER 
               TO LAST-ROUND (STARTING-NUMBER (ZAEHLER) + 1)
           END-PERFORM

           MOVE STARTING-NUMBER (ZAEHLER - 1)
             TO LAST-ANNOUNCED-NUMBER
           SUBTRACT 1 FROM ZAEHLER GIVING ROUND-NUMBER

           SUBTRACT ROUND-NUMBER FROM ROUNDS-TO-PLAY
           PERFORM ROUNDS-TO-PLAY TIMES
             ADD 1 TO ROUND-NUMBER
             PERFORM BERECHNE-NEXT-NUMBER
             PERFORM UPDATE-TABELLE
           END-PERFORM
           DISPLAY "Ergebnis:" NEXT-NUMBER

           STOP RUN.
       BERECHNE-NEXT-NUMBER SECTION.
           MOVE LAST-ANNOUNCED-NUMBER
             TO NUMBER-TO-SAVE
           IF LAST-ROUND (LAST-ANNOUNCED-NUMBER + 1) 
               <> ROUND-NUMBER - 1
              AND  LAST-ROUND (LAST-ANNOUNCED-NUMBER + 1) <> 0
           THEN
               COMPUTE NEXT-NUMBER = 
                     ROUND-NUMBER - 1 - LAST-ROUND (NEXT-NUMBER + 1)
           ELSE
              MOVE ZERO TO NEXT-NUMBER
           END-IF
           MOVE NEXT-NUMBER TO LAST-ANNOUNCED-NUMBER

           IF LAST-ANNOUNCED-NUMBER > MAX-ANNOUNCED-NUMBER THEN
                MOVE LAST-ANNOUNCED-NUMBER
                  TO MAX-ANNOUNCED-NUMBER
                DISPLAY "MAX ANNOUNCED NUMBER: " MAX-ANNOUNCED-NUMBER 
                        " AT ROUND " ROUND-NUMBER
           END-IF

       EXIT.

       UPDATE-TABELLE SECTION.
          SUBTRACT 1 
              FROM ROUND-NUMBER 
        GIVING     LAST-ROUND (NUMBER-TO-SAVE + 1)
       EXIT.
