       IDENTIFICATION DIVISION.
       PROGRAM-ID.  BASEM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 W-TEXTFELD                                   PIC X(10).
       PROCEDURE DIVISION.
           STOP RUN.

       S-MAIN SECTION.
           MOVE 'HALLO WELT' TO W-TEXTFELD
           EXIT.