           TESTSUITE 'UNIT TESTS FOR FIZZBUZZ.CBL'

           TESTCASE 'IT RETURNS FIZZ FOR THE NUMBER 3 (DIVISIBLE BY 3)'
           MOVE 3 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE "FIZZ"

           TESTCASE 'IT RETURNS BUZZ FOR THE NUMBER 5 (DIVISIBLE BY 5)'
           MOVE 5 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE "BUZZ"

           TESTCASE 'IT RETURNS FIZZBUZZ FOR THE 15 (DIV BY 3 and 5)'
           MOVE 15 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE "FIZZBUZZ"

           TESTCASE 'IT RETURNS 1 FOR THE NUMBER 1'
           MOVE 1 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE NUMERIC 1

           TESTCASE 'IT RETURNS 101 FOR THE NUMBER 101'
           MOVE 101 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE NUMERIC 101
