           TESTSUITE 'UNIT TESTS FOR ANAGRAM.CBL!'

           TESTCASE 'IT RETURNS JA FOR THE INPUT A'
           MOVE "A" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           EXPECT CURRENT-RESULT TO BE 'JA'

           TESTCASE 'IT RETURNS NEIN FOR THE INPUT AB'
           MOVE "AB" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           EXPECT CURRENT-RESULT TO BE 'NEIN'

           TESTCASE 'IT RETURNS JA FOR THE INPUT ABBA'
           MOVE "ABBA" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           EXPECT CURRENT-RESULT TO BE 'JA'

           TESTCASE 'IT RETURNS JA FOR THE INPUT ABcBA'
           MOVE "ABcBA" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           EXPECT CURRENT-RESULT TO BE 'JA'

           TESTCASE 'IT RETURNS NEIN FOR THE INPUT ABcDBA'
           MOVE "ABcDBA" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           EXPECT CURRENT-RESULT TO BE 'NEIN'

           TESTCASE 'STRING-ENDE FOR AB IST 2'
           MOVE "AB" TO CURRENT-WORD
           PERFORM 1001-FIND-STRING-ENDE
           EXPECT POSITION-STRING-END TO BE '02'

           TESTCASE 'STRING-ENDE FOR SPACE IST 0'
           MOVE SPACE TO CURRENT-WORD
           PERFORM 1001-FIND-STRING-ENDE
           EXPECT POSITION-STRING-END TO BE '00'

           TESTCASE 'STRING-ENDE FOR "AB CD" IST 5'
           MOVE "AB CD" TO CURRENT-WORD
           PERFORM 1001-FIND-STRING-ENDE
           EXPECT POSITION-STRING-END TO BE '05'
