       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANAGRAMM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
            COPY ZUTZCWS     .
       01  TEMP-FELDER.
           05  CURRENT-WORD     PIC X(20).
           05  CURRENT-WORD-REVERSED PIC X(20).
           05  CURRENT-RESULT   PIC X(12).
           05  POSITION-STRING-END PIC 99.
           05  COUNTER PIC 99.
           05  IST-ANAGRAM-KZ PIC X.
              88 IST-ANAGRAM VALUE 'J'.
              88 IST-KEIN-ANAGRAM VALUE 'N'.
           05 STRING-AUS-DB PIC XX.

       PROCEDURE DIVISION.
           PERFORM UT-INITIALIZE

           DISPLAY SPACE
           DISPLAY "TEST SUITE:"
           DISPLAY
           'UNIT TESTS FOR ANAGRAM.CBL!'
           DISPLAY SPACE

           MOVE 'IT RETURNS JA FOR THE INPUT A'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "A" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE CURRENT-RESULT TO UT-ACTUAL
           MOVE 'JA'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT RETURNS NEIN FOR THE INPUT AB'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "AB" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE CURRENT-RESULT TO UT-ACTUAL
           MOVE 'NEIN'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT RETURNS JA FOR THE INPUT ABBA'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "ABBA" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE CURRENT-RESULT TO UT-ACTUAL
           MOVE 'JA'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT RETURNS JA FOR THE INPUT ABcBA'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "ABcBA" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE CURRENT-RESULT TO UT-ACTUAL
           MOVE 'JA'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'IT RETURNS NEIN FOR THE INPUT ABcDBA'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "ABcDBA" TO CURRENT-WORD
           PERFORM 1000-PROCESS-WORD
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE CURRENT-RESULT TO UT-ACTUAL
           MOVE 'NEIN'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'STRING-ENDE FOR AB IST 2'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "AB" TO CURRENT-WORD
           PERFORM 1001-FIND-STRING-ENDE
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE POSITION-STRING-END TO UT-ACTUAL
           MOVE '02'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'STRING-ENDE FOR SPACE IST 0'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE SPACE TO CURRENT-WORD
           PERFORM 1001-FIND-STRING-ENDE
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE POSITION-STRING-END TO UT-ACTUAL
           MOVE '00'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL

           PERFORM UT-AFTER
           MOVE 'STRING-ENDE FOR "AB CD" IST 5'
               TO UT-TEST-CASE-NAME
           PERFORM UT-BEFORE
           MOVE "AB CD" TO CURRENT-WORD
           PERFORM 1001-FIND-STRING-ENDE
           ADD 1 TO UT-TEST-CASE-COUNT
           SET UT-NORMAL-COMPARE TO TRUE
           MOVE POSITION-STRING-END TO UT-ACTUAL
           MOVE '05'
                       TO UT-EXPECTED
           SET UT-COMPARE-DEFAULT TO TRUE
           PERFORM UT-ASSERT-EQUAL
           PERFORM UT-AFTER
            COPY ZUTZCPD     .
           .
       UT-BEFORE.

           .
       UT-AFTER.

           .
       UT-INITIALIZE.
           MOVE SPACE TO UT-FILE-INFORMATION

           .
       UT-END.

           DISPLAY CURRENT-RESULT
           GOBACK
           .
          .

           .
       1000-PROCESS-WORD SECTION.
           MOVE "JA"
             TO CURRENT-RESULT

           PERFORM 1001-FIND-STRING-ENDE

           MOVE FUNCTION REVERSE(CURRENT-WORD(1:POSITION-STRING-END))
             TO CURRENT-WORD-REVERSED


           PERFORM VARYING COUNTER FROM 1 BY 1
            UNTIL COUNTER > 20
            IF CURRENT-WORD (COUNTER:1)
              NOT = CURRENT-WORD-REVERSED (COUNTER:1)
            THEN
              MOVE "NEIN"
                TO CURRENT-RESULT

               EXIT PERFORM
            END-IF
           END-PERFORM

           .
       1000Z.
           EXIT

           .
       1001-FIND-STRING-ENDE SECTION.
           INITIALIZE POSITION-STRING-END
           INSPECT CURRENT-WORD
                   TALLYING POSITION-STRING-END
                   FOR TRAILING SPACE

           SUBTRACT POSITION-STRING-END
                    FROM FUNCTION LENGTH(CURRENT-WORD)
                    GIVING POSITION-STRING-END

           .
       1001Z.
           EXIT


           .
       END PROGRAM ANAGRAMM.
