           TESTSUITE 'Testsuite'

           TESTCASE 'Test, ob Testframework funktioniert'
               PERFORM S-MAIN
           EXPECT W-TEXTFELD TO BE "HALLO WELT"